"""
    最后更新时间: 2024年9月21日
        英雄和装备数据
"""

# 基本装备
BASIC_ITEM: set[str] = {"暴风之剑", "反曲之弓", "无用大棒", "女神之泪", "锁子甲", "负极斗篷", "巨人腰带", "金铲铲","拳套", "金锅锅"}
# 合成装备
COMBINED_ITEMS: set[str] = {"死亡之刃",
                            "巨人杀手",
                            "海克斯科技枪刃",
                            "朔极之矛",
                            "饮血剑",
                            "无尽之刃",
                            "鬼索的狂暴之刃",
                            "斯塔堤克电刃",
                            "泰坦的坚决",
                            "卢安娜的飓风",
                            "纳什之牙",
                            "最后的轻语",
                            "灭世者的死亡之帽",
                            "大天使之杖",
                            "离子火花",
                            "莫雷洛秘典",
                            "珠光护手",
                            "蓝霸符",
                            "救赎",
                            "正义之手",
                            "棘刺背心",
                            "石像鬼石板甲",
                            "日炎斗篷",
                            "巨龙之爪",
                            "水银",
                            "狂徒铠甲",
                            "金铲铲冠冕",
                            "窃贼手套",
                            "破防者",
                            "斯特拉克的挑战护手",
                            "冕卫",
                            "适应性头盔",
                            "薄暮法袍",
                            "红霸符",
                            "坚定之心",
                            "夜之锋刃",
                            "圣盾使的誓约",
                            "小蜜蜂纹章",
                            "魔神使者纹章",
                            "花仙子纹章",
                            "咖啡甜心纹章",
                            "次元术士纹章",
                            "炎魔纹章",
                            "冰霜纹章",
                            "诅咒女巫纹章",
                            "堡垒卫士纹章",
                            "狂暴战士纹章",
                            "猎手纹章",
                            "法师纹章",
                            "复苏者纹章",
                            "学者纹章",
                            "换形师纹章",
                            "魔战士纹章",
                            "金锅铲冠冕",
                            "金锅锅冠冕",
                            }

# 前排通用装备名单
FRONTLINE_ITEMS: set[str] = {
                            "锁子甲",
                            "负极斗篷",
                            "巨人腰带",
                            "军团圣盾",
                            "女妖面纱",
                            "殉道美德",
                            "钢铁烈阳之匣",
                            "无用大宝石",
                            "兰顿之兆",
                            "兹若特传送门",
                            "永恒烈焰",
                            "骑士之誓",
                            "不稳定的财宝箱",
                            "大亨之铠",
                            "生命盔甲",
                            "永恒凛冬",
                            "碎舰者",
                            "诡术师之镜",
                            "密银黎明",
                            "暗行者之爪",
                            "幽魂弯刀",
                            "禁忌雕像",
                            "光盾徽章",
                            "探索者的护臂",

}

# 后排通用装备名单
REAR_ITEMS: set[str] = {
                        "暴风之剑",
                        "反曲之弓",
                        "无用大棒",
                        "女神之泪",
                        "拳套",
                        "余烬之冠",
                        "能量圣杯",
                        "黑曜石切割者",
                        "静止法衣",
                        "基克的先驱",
                        "灵风",
                        "辅助手套",
                        "月石再生器",
                        "恶意",
                        "投机者之刃",
                        "坚定投资器",
                        "死亡之蔑",
                        "魔蕴",
                        "三相之力",
                        "金币收集者",
                        "中娅悖论",
                        "狙击手的专注",
                        "冥火之拥",
                        "铁匠手套",
                        "钻石之手",
                        "飞升护符",
                        "黑暗吸血鬼节杖",
                        "鱼骨头",
                        "迷离风衣",
                        "视界专注",
                        "连指手套",
                        "无终恨意",
                        "疾射火炮",
                        "激发之匣",
                        "卢登的激荡",
                        "枯萎珠宝",
                        "智慧末刃",
                        "巫妖之祸",


}

# 辅助装备
SUPPORT_ITEM: set[str] = {"军团圣盾",
                          "女妖面纱",
                          "余烬之冠",
                          "殉道美德",
                          "能量圣杯",
                          "钢铁烈阳之匣",
                          "无用大宝石",
                          "黑曜石切割者",
                          "兰顿之兆",
                          "静止法衣",
                          "基克的先驱",
                          "灵风",
                          "兹若特传送门",
                          "辅助手套",
                          "永恒烈焰",
                          "骑士之誓",
                          "月石再生器",
                          "恶意",
                          "不稳定的财宝箱",
                          }

# 不可合成的
NON_CRAFTABLE_ITEMS: set[str] = {"次级英雄复制器", "英雄复制器", "命运之子符印", "命运之子纹章", "时间学派纹章",
                                 "术师纹章", "重装战士纹章", "强袭枪手纹章", "大亨之铠", "投机者之刃", "坚定投资器",
                                 "装备拆卸器","装备重铸器","一个轻食点心"}
# 奥恩装备
ORNN_ITEMS: set[str] = {"生命盔甲",
                        "死亡之蔑",
                        "魔蕴",
                        "三相之力",
                        "永恒凛冬",
                        "金币收集者",
                        "中娅悖论",
                        "碎舰者",
                        "诡术师之镜",
                        "狙击手的专注",
                        "冥火之拥",
                        "铁匠手套",
                        "钻石之手",
                        "飞升护符",
                        "黑暗吸血鬼节杖",
                        "鱼骨头",
                        "迷离风衣",
                        "视界专注",
                        "连指手套",
                        "无终恨意",
                        "疾射火炮",
                        "激发之匣",
                        "卢登的激荡",
                        "密银黎明",
                        "暗行者之爪",
                        "幽魂弯刀",
                        "枯萎珠宝",
                        "智慧末刃",
                        "禁忌雕像",
                        "巫妖之祸",
                        "光盾徽章",
                        "探索者的护臂",
                        }

ITEMS: set[str] = BASIC_ITEM.union(COMBINED_ITEMS).union(SUPPORT_ITEM).union(NON_CRAFTABLE_ITEMS).union(ORNN_ITEMS)

# 默认英雄信息 英雄名称:金币:x,占人口容量:x,羁绊1:羁绊信息,羁绊2:羁绊信息,羁绊3:羁绊信息
CHAMPIONS: dict[str, dict[str, int]] = {
    "图奇": {"Gold": 1, "Board Size": 1, "Trait1": "冰霜", "Trait2": "猎手", "Trait3": ""},
    "沃里克": {"Gold": 1, "Board Size": 1, "Trait1": "冰霜", "Trait2": "重装战士", "Trait3": ""},
    "贾克斯": {"Gold": 1, "Board Size": 1, "Trait1": "时间学派", "Trait2": "魔战士", "Trait3": ""},
    "布里茨": {"Gold": 1, "Board Size": 1, "Trait1": "小蜜蜂", "Trait2": "重装战士", "Trait3": ""},
    "伊莉丝": {"Gold": 1, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "换形师", "Trait3": ""},
    "杰斯": {"Gold": 1, "Board Size": 1, "Trait1": "次元术士", "Trait2": "换形师", "Trait3": ""},
    "艾希": {"Gold": 1, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "魔战士", "Trait3": ""},
    "佐伊": {"Gold": 1, "Board Size": 1, "Trait1": "次元术士", "Trait2": "诅咒女巫", "Trait3": "学者"},
    "莉莉娅": {"Gold": 1, "Board Size": 1, "Trait1": "花仙子", "Trait2": "堡垒卫士", "Trait3": ""},
    "诺姆希": {"Gold": 1, "Board Size": 1, "Trait1": "龙族", "Trait2": "猎手", "Trait3": ""},
    "波比": {"Gold": 1, "Board Size": 1, "Trait1": "诅咒女巫", "Trait2": "堡垒卫士", "Trait3": ""},
    "吉格斯": {"Gold": 1, "Board Size": 1, "Trait1": "小蜜蜂", "Trait2": "术师", "Trait3": ""},
    "索拉卡": {"Gold": 1, "Board Size": 1, "Trait1": "咖啡甜心", "Trait2": "法师", "Trait3": ""},
    "萨勒芬妮": {"Gold": 1, "Board Size": 1, "Trait1": "花仙子", "Trait2": "法师", "Trait3": ""},

    "基兰": {"Gold": 2, "Board Size": 1, "Trait1": "冰霜", "Trait2": "时间学派", "Trait3": "复苏者"},
    "崔丝塔娜": {"Gold": 2, "Board Size": 1, "Trait1": "花仙子", "Trait2": "强袭枪手", "Trait3": ""},
    "尼菈": {"Gold": 2, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "狂暴战士", "Trait3": ""},
    "卡萨丁": {"Gold": 2, "Board Size": 1, "Trait1": "次元术士", "Trait2": "魔战士", "Trait3": ""},
    "克格莫": {"Gold": 2, "Board Size": 1, "Trait1": "小蜜蜂", "Trait2": "猎手", "Trait3": ""},
    "卡西奥佩娅": {"Gold": 2, "Board Size": 1, "Trait1": "诅咒女巫", "Trait2": "术师", "Trait3": ""},
    "辛德拉": {"Gold": 2, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "术师", "Trait3": ""},
    "努努": {"Gold": 2, "Board Size": 1, "Trait1": "小蜜蜂", "Trait2": "堡垒卫士", "Trait3": ""},
    "阿卡丽": {"Gold": 2, "Board Size": 1, "Trait1": "炎魔", "Trait2": "狂暴战士", "Trait3": "魔战士"},
    "加里奥": {"Gold": 2, "Board Size": 1, "Trait1": "次元术士", "Trait2": "重装战士", "Trait3": "法师"},
    "希瓦娜": {"Gold": 2, "Board Size": 1, "Trait1": "龙族", "Trait2": "换形师", "Trait3": ""},
    "兰博": {"Gold": 2, "Board Size": 1, "Trait1": "咖啡甜心", "Trait2": "重装战士", "Trait3": "强袭枪手"},
    "阿狸": {"Gold": 2, "Board Size": 1, "Trait1": "命运之子", "Trait2": "学者", "Trait3": ""},

    "彗": {"Gold": 3, "Board Size": 1, "Trait1": "冰霜", "Trait2": "强袭枪手", "Trait3": ""},
    "薇古丝": {"Gold": 3, "Board Size": 1, "Trait1": "时间学派", "Trait2": "法师", "Trait3": ""},
    "卡特琳娜": {"Gold": 3, "Board Size": 1, "Trait1": "花仙子", "Trait2": "狂暴战士", "Trait3": ""},
    "赫卡里姆": {"Gold": 3, "Board Size": 1, "Trait1": "命运之子", "Trait2": "堡垒卫士", "Trait3": "魔战士"},
    "妮蔻": {"Gold": 3, "Board Size": 1, "Trait1": "诅咒女巫", "Trait2": "换形师", "Trait3": ""},
    "伊泽瑞尔": {"Gold": 3, "Board Size": 1, "Trait1": "次元术士", "Trait2": "强袭枪手", "Trait3": ""},
    "金克丝": {"Gold": 3, "Board Size": 1, "Trait1": "咖啡甜心", "Trait2": "猎手", "Trait3": ""},
    "维迦": {"Gold": 3, "Board Size": 1, "Trait1": "小蜜蜂", "Trait2": "法师", "Trait3": ""},
    "巴德": {"Gold": 3, "Board Size": 1, "Trait1": "咖啡甜心", "Trait2": "复苏者", "Trait3": "学者"},
    "莫德凯撒": {"Gold": 3, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "重装战士", "Trait3": ""},
    "慎": {"Gold": 3, "Board Size": 1, "Trait1": "炎魔", "Trait2": "堡垒卫士", "Trait3": ""},
    "斯维因": {"Gold": 3, "Board Size": 1, "Trait1": "冰霜", "Trait2": "换形师", "Trait3": ""},
    "孙悟空": {"Gold": 3, "Board Size": 1, "Trait1": "德鲁伊", "Trait2": "", "Trait3": ""},

    "卡尔玛": {"Gold": 4, "Board Size": 1, "Trait1": "时间学派", "Trait2": "术师", "Trait3": ""},
    "菲奥娜": {"Gold": 4, "Board Size": 1, "Trait1": "诅咒女巫", "Trait2": "狂暴战士", "Trait3": ""},
    "格温": {"Gold": 4, "Board Size": 1, "Trait1": "咖啡甜心", "Trait2": "狂暴战士", "Trait3": ""},
    "洛": {"Gold": 4, "Board Size": 1, "Trait1": "花仙子", "Trait2": "复苏者", "Trait3": ""},
    "塔姆": {"Gold": 4, "Board Size": 1, "Trait1": "命运之子", "Trait2": "重装战士", "Trait3": ""},
    "卡莉丝塔": {"Gold": 4, "Board Size": 1, "Trait1": "花仙子", "Trait2": "魔战士", "Trait3": ""},
    "瑞兹": {"Gold": 4, "Board Size": 1, "Trait1": "次元术士", "Trait2": "学者", "Trait3": ""},
    "娜美": {"Gold": 4, "Board Size": 1, "Trait1": "魔神使者", "Trait2": "法师", "Trait3": ""},
    "韦鲁斯": {"Gold": 4, "Board Size": 1, "Trait1": "炎魔", "Trait2": "强袭枪手", "Trait3": ""},
    "内瑟斯": {"Gold": 4, "Board Size": 1, "Trait1": "炎魔", "Trait2": "换形师", "Trait3": ""},
    "塔里克": {"Gold": 4, "Board Size": 1, "Trait1": "次元术士", "Trait2": "堡垒卫士", "Trait3": ""},
    "奥拉夫": {"Gold": 4, "Board Size": 1, "Trait1": "冰霜", "Trait2": "猎手", "Trait3": ""},

    "黛安娜": {"Gold": 5, "Board Size": 1, "Trait1": "冰霜", "Trait2": "堡垒卫士", "Trait3": ""},
    "斯莫德": {"Gold": 5, "Board Size": 1, "Trait1": "龙族", "Trait2": "强袭枪手", "Trait3": ""},
    "卡蜜尔": {"Gold": 5, "Board Size": 1, "Trait1": "时间学派", "Trait2": "魔战士", "Trait3": ""},
    "贝蕾亚": {"Gold": 5, "Board Size": 1, "Trait1": "狂厄蔷薇", "Trait2": "魔神使者", "Trait3": "换形师"},
    "莫甘娜": {"Gold": 5, "Board Size": 1, "Trait1": "诅咒女巫", "Trait2": "蝙蝠女王", "Trait3": "复苏者"},
    "泽拉斯": {"Gold": 5, "Board Size": 1, "Trait1": "命运之子", "Trait2": "飞升者", "Trait3": "护卫"},
    "米利欧": {"Gold": 5, "Board Size": 1, "Trait1": "花仙子", "Trait2": "学者", "Trait3": ""},
    "诺拉与悠米": {"Gold": 5, "Board Size": 1, "Trait1": "次元术士", "Trait2": "最佳好友", "Trait3": "法师"},
}

ROUNDS: set[str] = {"1-1", "1-2", "1-3", "1-4",
                    "2-1", "2-2", "2-3", "2-4", "2-5", "2-6", "2-7", "2-8",
                    "3-1", "3-2", "3-3", "3-4", "3-5", "3-6", "3-7", "3-8",
                    "4-1", "4-2", "4-3", "4-4", "4-5", "4-6", "4-7", "4-8",
                    "5-1", "5-2", "5-3", "5-4", "5-5", "5-6", "5-7", "5-8",
                    "6-1", "6-2", "6-3", "6-4", "6-5", "6-6", "6-7", "6-8",
                    "7-1", "7-2", "7-3", "7-4", "7-5", "7-6", "7-7", "7-8"}

SECOND_ROUND: set[str] = {"1-2"}

# 选秀回合
CAROUSEL_ROUND: set[str] = {"1-1", "2-4", "3-4", "4-4", "5-4", "6-4", "7-4"}

PVE_ROUND: set[str] = {"1-3", "1-4", "2-7", "3-7", "4-7", "5-7", "6-7", "7-7"}

PVP_ROUND: set[str] = {"2-1", "2-2", "2-3", "2-5", "2-6",
                       "3-1", "3-2", "3-3", "3-5", "3-6",
                       "4-1", "4-2", "4-3", "4-5", "4-6",
                       "5-1", "5-2", "5-3", "5-5", "5-6",
                       "6-1", "6-2", "6-3", "6-5", "6-6",
                       "7-1", "7-2", "7-3", "7-5", "7-6"}
# 拾取战利品回合
PICKUP_ROUNDS: set[str] = {"2-1", "3-1", "4-1", "4-3", "5-1", "6-1", "7-1"}

ANVIL_ROUNDS: set[str] = {"2-1", "2-5", "3-1", "3-5", "4-1", "4-5", "5-1", "5-5", "6-1", "6-5", "7-1", "7-5"}

# 正常情况下这些回合会增加人口
AUGMENT_ROUNDS: set[str] = {"2-1", "3-2", "4-2"}

# 这些回合给装备
ITEM_PLACEMENT_ROUNDS: set[str] = {
    "2-1", "2-5", "2-7",
    "3-1", "3-3", "3-5", "3-7",
    "4-1", "4-2", "4-3", "4-4", "4-5", "4-7",
    "5-1", "5-2", "5-3", "5-4", "5-5", "5-7",
    "6-1", "6-2", "6-3", "6-5", "6-6", "6-7",
    "7-1", "7-2", "7-3", "7-5", "7-6", "7-7"
}
# 刚开始的回合
ENCOUNTER_ROUNDS: set[str] = {"0-0"}

# 自动投降回合
FINAL_COMP_ROUND = "5-5"

#合成表
FULL_ITEMS = {
    "死亡之刃": ("暴风之剑", "暴风之剑"),
    "巨人杀手": ("暴风之剑", "反曲之弓"),
    "海克斯科技枪刃": ("暴风之剑", "无用大棒"),
    "朔极之矛": ("暴风之剑", "女神之泪"),
    "饮血剑": ("暴风之剑", "负极斗篷"),
    "无尽之刃": ("暴风之剑", "拳套"),
    "斯特拉克的挑战护手": ("暴风之剑", "巨人腰带"),
    "夜之锋刃": ("暴风之剑", "锁子甲"),
    "咖啡甜心纹章": ("暴风之剑", "金铲铲"),
    "猎手纹章": ("暴风之剑", "金锅锅"),

    "鬼索的狂暴之刃": ("反曲之弓", "无用大棒"),
    "斯塔缇克电刃": ("反曲之弓", "女神之泪"),
    "泰坦的坚决": ("反曲之弓", "锁子甲"),
    "卢安娜的飓风": ("反曲之弓", "负极斗篷"),
    "纳什之牙": ("反曲之弓", "巨人腰带"),
    "最后的轻语": ("反曲之弓", "拳套"),
    "红霸符": ("反曲之弓", "反曲之弓"),
    "炎魔纹章": ("反曲之弓", "金铲铲"),
    "魔战士纹章": ("反曲之弓", "金锅锅"),

    "灭世者的死亡之帽": ("无用大棒", "无用大棒"),
    "大天使之杖": ("无用大棒", "女神之泪"),
    "离子火花": ("无用大棒", "负极斗篷"),
    "莫雷洛秘典": ("无用大棒", "巨人腰带"),
    "珠光护手": ("无用大棒", "拳套"),
    "冕卫": ("无用大棒", "锁子甲"),
    "次元术士纹章": ("无用大棒", "金铲铲"),
    "法师纹章": ("无用大棒", "金锅锅"),

    "蓝霸符": ("女神之泪", "女神之泪"),
    "救赎": ("女神之泪", "巨人腰带"),
    "正义之手": ("女神之泪", "拳套"),
    "适应性头盔": ("女神之泪", "负极斗篷"),
    "圣盾使的誓约": ("女神之泪", "锁子甲"),
    "花仙子纹章": ("女神之泪", "金铲铲"),
    "学者纹章": ("女神之泪", "金锅锅"),

    "棘刺背心": ("锁子甲", "锁子甲"),
    "石像鬼石板甲": ("锁子甲", "负极斗篷"),
    "日炎斗篷": ("锁子甲", "巨人腰带"),
    "坚定之心": ("锁子甲", "拳套"),
    "冰霜纹章": ("锁子甲", "金铲铲"),
    "堡垒卫士纹章": ("锁子甲", "金锅锅"),

    "巨龙之爪": ("负极斗篷", "负极斗篷"),
    "水银": ("负极斗篷", "拳套"),
    "诅咒女巫纹章": ("负极斗篷", "金铲铲"),
    "复苏者纹章": ("负极斗篷", "金锅锅"),

    "狂徒铠甲": ("巨人腰带", "巨人腰带"),
    "破防者": ("巨人腰带", "拳套"),
    "薄暮法袍": ("巨人腰带", "负极斗篷"),
    "魔神使者纹章": ("巨人腰带", "金铲铲"),
    "换形师纹章": ("巨人腰带", "金锅锅"),



    "金铲铲冠冕": ("金铲铲", "金铲铲"),
    "小蜜蜂纹章": ("金铲铲", "拳套"),
    "金锅铲冠冕": ("金铲铲", "金锅锅"),

    "狂暴战士纹章": ("金锅锅", "拳套"),
    "窃贼手套": ("拳套", "拳套"),

    "金锅锅冠冕": ("金锅锅", "金锅锅"),

    # 测试自定义多装备

    "次级英雄复制器": ("", ""),
    "英雄复制器": ("", ""),

    "强袭枪手纹章": ("强袭枪手纹章", ""),
    "命运之子符印": ("命运之子符印", ""),
    "花仙王冕": ("花仙王冕", ""),

    "装备拆卸器": ("装备拆卸器", ""),
    "暴风之剑": ("暴风之剑", ""),
    "锁子甲": ("锁子甲", ""),
    "装备重铸器": ("", ""),
    "一个轻食点心": ("一个轻食点心", "一个轻食点心"),



}


def champion_board_size(champion: str) -> int:
    """Takes a string (champion name) and returns board size of champion"""
    return CHAMPIONS[champion]["Board Size"]


def champion_gold_cost(champion: str) -> int:
    """根据字符串（英雄名称）返回英雄购买需要的金币"""
    return CHAMPIONS[champion]["Gold"]
